app/controllers/invoices/purchases_controller.rb

SELECT  "invoices".* FROM "invoices"  WHERE "invoices"."id" = ? LIMIT 1  [["id", 7]]
---
  def new
    @invoice = Invoice.find(params[:invoice_id])

SELECT  "invoices".* FROM "invoices"  WHERE "invoices"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "purchases" ("category", "created_at", "invoice_id", "name", "price", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category", "ee"], ["created_at", "2014-09-09 07:21:30.079456"], ["invoice_id", 7], ["name", "rr"], ["price", 5.0], ["quantity", 5], ["updated_at", "2014-09-09 07:21:30.079456"]]
---
  def create
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.new(purchase_params)
    @purchase.invoice = @invoice

    respond_to do |format|
      if @purchase.save

SELECT  "invoices".* FROM "invoices"  WHERE "invoices"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "purchases".* FROM "purchases"  WHERE "purchases"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]
---
 def destroy
    @invoice = Invoice.find(params[:invoice_id])
    @purchase = Purchase.find(params[:id])
    title = @purchase.name

    if @purchase.destroy