app/views/invoices/_form.html.erb

      <div class="controls">
        <%= collection_select( :invoice, :employee_id, Employee.all, :id, :name, {}, {:multiple => false }) %>
---
SELECT "employees".* FROM "employees"