app/controllers/companies_controller.rb

INSERT INTO "companies" ("created_at", "manager", "name", "status", "terms", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-28 07:33:24.765532"], ["manager", "me"], ["name", "me"], ["status", "hold"], ["terms", 1], ["updated_at", "2014-08-28 07:33:24.765532"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save

UPDATE "companies" SET "terms" = ?, "updated_at" = ? WHERE "companies"."id" = 1  [["terms", 30], ["updated_at", "2014-08-28 07:33:47.239696"]]
---
  def update
    respond_to do |format|
      if @company.update(company_params)