app/controllers/invoices_controller.rb

INSERT INTO "invoices" ("company", "created_at", "date", "salesperson", "tax", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["company", "me"], ["created_at", "2014-07-08 15:14:39.816077"], ["date", "2014-07-08 15:14:00.000000"], ["salesperson", "mark"], ["tax", 5.7], ["updated_at", "2014-07-08 15:14:39.816077"]]
---
  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 5]]
---
  def destroy
    @invoice.destroy

SELECT "invoices".* FROM "invoices"  WHERE (date BETWEEN '2014-08-18' AND '2014-08-24')
---
    def set_invoice
      @invoice = Invoice.find(params[:id])